/* 
  Localizable.strings
  MiniProgram

  Created by zacharysu(粟子明) on 2020/6/9.
  Copyright © 2020 Tencent. All rights reserved.
*/

"App.Name" = "微信小程序";

"Common.Dialog.OK" = "确定";
"Common.Dialog.Finish" = "完成";
"Common.Dialog.Cancel" = "取消";
"Common.Navigation.Back" = "返回";
"Common.Cancel" = "取消";
"Common.Delete" = "删除";
"Common.Send" = "确定";
"Common.Exit" = "退出";
"Common.Close" = "关闭";
"Common.More" = "更多";
"Common.Alert.Hint.Title" = "提示";

/* JSAPI scope 授权界面 start */
"JSScopeConfirmWindow_Title_Login" = "微信登录";
"JSScopeConfirmWindow_Title_Authorize" = "微信授权";
"JSScopeConfirmWindow_Description" = "%@申请获得以下权限:";
"JSScopeConfirmWindow_Allow" = "允许";
"JSScopeConfirmWindow_Reject" = "取消";
"JSScopeConfirmWindow_Account_Desc" = "微信个人信息";

"JSScope.Privacy.Location.Desc" = "请在Mac的“系统偏好设置-安全性与隐私-定位服务”选项中，允许微信访问你的定位服务。";
"JSScope.Privacy.PhotoAdd.Desc" = "请在Mac的“系统偏好设置-安全性与隐私-照片”选项中，允许微信访问你的相册。";
"JSScope.Privacy.Camera.Desc" = "请在Mac的“系统偏好设置-安全性与隐私-摄像头”选项中，允许微信访问你的前置摄像头。";
"JSScope.Privacy.Microphone.Desc" = "请在Mac的“系统偏好设置-安全性与隐私-麦克风”选项中，允许微信访问你的麦克风。";
"JSScope.Privacy.ScreenCapture.Desc" = "请在Mac的“系统偏好设置-安全性与隐私-屏幕录制”选项中，允许微信录制屏幕内容。";


//小程序菜单
"WCAppBrand_MenuItem_Setting" = "设置";
"WCAppBrand_MenuItem_BannerQuickAddTips" = "是否添加%@到你的小程序";
"WCAppBrand_MenuItem_OpenDebugMode" = "打开调试";
"WCAppBrand_MenuItem_CloseDebugMode" = "关闭调试";
"WCAppBrand_MenuItem_OpenPerformance" = "显示性能窗口";
"WCAppBrand_MenuItem_ClosePerformance" = "关闭性能窗口";
"WCAppBrand_MenuItem_DebugModeTips" = "重新打开后生效";
"WCAppBrand_MenuItem_Focused" = "已添加";
"WCAppBrand_MenuItem_Expose" = "投诉";
"WCAppBrand_MenuItem_Feedback" = "意见反馈";
"WCAppBrand_MenuItem_StaredToast" = "添加成功";
"WCAppBrand_MenuItem_StarFailed" = "添加失败";
"WCAppBrand_MenuItem_UnstaredToast" = "已取消";
"WCAppBrand_MenuItem_UnstaredFailToast" = "取消失败";
"WCAppBrand_MenuItem_openVCLogTips" = "测试版开始时间:%@ \n测试版结束时间:%@ \n是否启用调试公共库:%d \n测试公共库更新时间:%@ \n测试公共库结束时间:%@ \n正式版公共库版本:%lu \n公共库更新时间:%@";
"WCAppBrand_MenuItem_BackToMain" = "回到首页";
"WCAppBrand_MenuItem_BackToChat" = "显示在聊天顶部";
"WCAppBrand_MenuItem_RemoveWeappBanner" = "从聊天顶部移除";
"WCAppBrand_MenuItem_LeaveInChatTips" = "已取消置顶";
"WCAppBrand_MenuItem_CommonShare" = "转发";
"WCAppBrand_MenuItem_CommonShareToWeWork" = "分享到企业微信";
"WCAppBrand_MenuItem_CommonShareToWeChat" = "分享到微信";
"WCAppBrand_MenuItem_AddToHomeScreen" = "添加到桌面";
"WCAppBrand_MenuItem_AboutUs" = "关于我们";
"WCAppBrand_MenuItem_About" = "设置";
"WCAppBrand_MenuItem_Comment" = "评论";
"WCAppBrand_MenuItem_Leave" = "离开";
"WCAppBrand_MenuItem_CopyPathAndQuery" = "复制本页面路径";
"WCAppBrand_MenuItem_BackToIndex" = "返回首页";
"WCAppBrand_MenuItem_AddToStar" = "添加到我的小程序";
"WCAppBrand_MenuItem_CancelStar" = "从我的小程序中移除";
"WCAppBrand_MenuItem_AddToStarSuccess" = "已添加";
"WCAppBrand_MenuItem_CancelStarSuccess" = "已移除";
"WCAppBrand_MenuItem_Minimize" = "最小化";
"WCAppBrand_MenuItem_WideScreen" = "宽屏模式";
"WCAppBrand_MenuItem_NarrowScreen" = "普通模式";

"WCAppBrand_ImageChoosePanel_OriginImage"  = "原图";
"WeApp_ChooseImage_Menu_Camera" = "拍照";
"WeApp_ChooseImage_Menu_Other" = "从本地选择...";
"WeApp_ChooseImage_No_Camera" = "没有可用的摄像头";
"WeApp_ChooseImage_No_Camera_Privacy" = "没有摄像头权限";
"WeApp_ChooseImage_TakePhoto" = "拍照";
"WeApp_ChooseImage_TakePhoto_Confirm" = "使用照片";
"WeApp_ChooseImage_TakePhoto_Retry" = "重拍";
"WeApp_ChooseImage_TakePhoto_Error" = "无法拍照，请检查是否有可用的摄像头。";


"WeApp_Error_Unknow" = "未知错误";
"WeApp_OpenTask_AlertTitle" = "打开失败";   //打开服务失败

"WeApp_OpenTask_Error_Parameter" = "参数错误";
"WeApp_OpenTask_Error_ExceedMaxWindow" = "最多只能打开%lu个小程序窗口";
"WeApp_OpenTask_Error_GameApp" = "Mac微信不支持打开小游戏";
"WeApp_OpenTask_Error_UnsupportApp" = "暂时不支持打开该小程序，请在手机上操作";
"WeApp_OpenTask_Error_UnsupportApp_Name" = "暂时不支持打开“%@”小程序，请在手机上操作";

"WeApp_OpenTask_Error_NoAppID" = "缺少ID";    //缺少服务ID
"WeApp_OpenTask_Error_Foreground" = "已在前台";     //服务已在前台
"WeApp_OpenTask_Error_Loading" = "正在加载中";       //服务正在加载中
"WeApp_OpenTask_Error_NoVersion" = "版本错误";      //服务版本错误
"WeApp_OpenTask_Error_HomePage" = "主页地址错误";     //服务主页地址错误
"WeApp_OpenTask_Error_CacheInfo" = "缓存信息错误";    //服务缓存信息错误
"WeApp_OpenTask_Error_NormalError" = "无法打开小程序,请稍后重试（错误码：%d）";
"WeApp_OpenTask_Error_NoPackageError" = "此小程序已过期，请重新扫描二维码（错误码：%d）";
"WeApp_OpenTask_Error_InternalError" = "内部错误";
"WeApp_OpenTask_Error_DownloadError" = "无法打开小程序,请检查网络（错误码：%d）";
"WeApp_OpenTask_Error_NavigationNil" = "推入导航栏失败";   //服务推入导航栏失败
"WeApp_OpenTask_Error_AppConfigFail" = "页面配置读取失败";
"WeApp_OpenTask_Error_ContactAttributeFail" = "属性信息读取失败";
"WeApp_OpenTask_Error_DebugUinInvalid" = "暂无体验权限";
"WeApp_OpenTask_Error_DebugOutOfTime" = "开发版二维码已失效";
"WeApp_OpenTask_Error_DebugDefault" = "二维码错误";
"WeApp_OpenTask_Error_LoadContactInfoFail" = "加载小程序信息超时";
"WeApp_OpenTask_Error_RDMNotExist" = "小程序体验版不存在，无法体验";
"WeApp_OpenTask_Error_RDMNetWorkFailed" = "网络请求超时，请稍后再试";
"WeApp_OpenTask_Error_RDMHasNoPermission" = "体验版小程序无体验权限，请联系小程序管理员";
"WeApp_OpenTask_Error_DevHasNoLocalPackInfo" = "开发版小程序已过期，请在开发者工具重新扫码";
"WeApp_OpenTask_Error_CdnDisaster" = "当前体验人数过多，请稍后重试";

"WeApp_Unsupport_Default" = "暂时不支持该功能，请在手机上进行操作";
"WeApp_Unsupport_insertMap" = "暂时不支持地图功能，请在手机上进行操作";
"WeApp_Unsupport_startRecord" = "暂时不支持录音功能，请在手机上进行操作";
"WeApp_Unsupport_address" = "暂时不支持使用地址功能，请在手机上进行操作";
"WeApp_Unsupport_InvoiceTitle" = "暂时不支持发票功能，请在手机上进行操作";
"WeApp_Unsupport_makePhoneCall" = "暂时不支持打电话功能，请在手机上进行操作";
"WeApp_Unsupport_scanCode" = "暂时不支持扫码功能，请在手机上进行操作";
"WeApp_Unsupport_card" = "暂时不支持卡券功能，请在手机上进行操作";
"WeApp_Unsupport_bluetooth" = "暂时不支持蓝牙功能，请在手机上进行操作";
"WeApp_Unsupport_WeRun" = "不支持获取微信运动步数，请在手机上进行操作";

"WeApp_Suspension_Service" = "小程序已暂停服务";      // 小程序已暂停服务
"WeApp_NotSupportThisVersion" = "小程序尚未发布";      //服务未发布

// 小程序Profile页面
"WeApp_Profile_EnterWeApp" = "进入小程序";
"WeApp_Profile_SuggestToFriend" = "推荐给朋友";
"WeApp_Profile_BussinessScope" = "服务类目";
"WeApp_Profile_DeveloperInfo" = "主体信息";
"WeApp_Profile_BindBrandInfo" = "相关公众号";
"WeApp_Profile_AuthorizationTips" = "允许\"%@\"使用我的：";
"WeApp_Profile_AuthorizationDenyTips" = "关闭授权可能会影响使用小程序的部分功能，请确认";
"WeApp_Profile_DenyAuthorization" = "关闭授权";
"WeApp_Profile_AuthorizationEmptyTip" = "\"%@\"未使用您任何信息";
"WeApp_Profile_NoMoreBindBrand" = "没有更多公众号";
"WeApp_Profile_AuthorizationLocationDeny" = "不允许";
"WeApp_Profile_AuthorizationLocationWhenInUseAllow" = "使用时";
"WeApp_Profile_AuthorizationLocationAlwaysAllow" = "使用时与离开后";
"WeApp_Profile_AuthorizationLocationDenyLongVer" = "不允许";
"WeApp_Profile_AuthorizationLocationWhenInUseAllowLongVer" = "仅在使用小程序期间";
"WeApp_Profile_AuthorizationLocationAlwaysAllowLongVer" = "使用小程序期间和离开小程序后";

"WeApp.ScopeKey.Location.Desc" = "位置信息";
"WeApp.ScopeKey.Account.Desc" = "用户信息";
"WeApp.ScopeKey.Camera.Desc" = "摄像头";
"WeApp.ScopeKey.MircoPhone.Desc" = "麦克风";
"WeApp.Camera.Not.Available" = "摄像头被占用或者未检测到，请稍后再试";
"WeApp.Navigate.MiniProgram.Tip" = "正在获取信息...";

// 小程序手机号授权
"WeApp_UserAutoFill_TitlePre" = "是否使用你保存的信息";
"WeApp_UserAutoFill_TitleAfter" = "是否保存填写的信息";
"WeApp_UserAutoFill_OpenDetail" = "了解详情";
"WeApp_UserAutoFill_PhoneAuthTitle" = "微信手机号授权";
"WeApp_UserAutoFill_PhoneAuthAllow" = "确认授权";
"WeApp_UserAutoFill_PhoneVerifyTitle" = "请填写手机短信验证码";
"WeApp_UserAutoFill_PhoneVerifyContent" = "已发送到手机号:%@";
"WeApp_UserAutoFill_PhoneVerifyNotReceive" = "收不到验证码？";
"WeApp_UserAutoFill_PhoneVerifyRetry" = "重新发送";
"WeApp_UserAutoFill_PhoneVerifyRetryInfo" = "验证码不正确，请重新发送";
"WeApp_UserAutoFill_PhoneVerifyRetryFrequently" = "操作频繁，请稍候再试";
"WeApp_UserAutoFill_PhoneBindTitle" = "微信帐号还没有绑定手机号";
"WeApp_UserAutoFill_PhoneBindContent" = "微信帐号绑定手机号后才可使用手机号快速填写功能";
"WeApp_UserAutoFill_PhoneBind" = "绑定手机号";
"WeApp_UserAutoFill_PhoneSmsTips" = "短信已发送";
"WeApp_UserAutoFill_PhoneBindTips" = "已保存";
"WeApp_UserAutoFill_PhoneSmsError" = "短信发送异常";
"WeApp_UserAutoFill_PhoneSmsFail" = "短信发送失败";
"WeApp_UserAutoFill_CountDown" = "%ds可重发";
"WeApp_UserAutoFill_AuthInfoTitle" = "微信手机号授权功能说明";
"WeApp_UserAutoFill_AuthComplaint" = "投诉该小程序";

"WeApp_GetPhoneNumber_RequireToGet" = "申请获得";
"WeApp_GetPhoneNumber_YourPhoneListTitle" = "你的手机号码";
"WeApp_GetPhoneNumber_ManagePhoneList" = "管理手机号码";
"WeApp_GetPhoneNumber_UseOtherPhone" = "使用其他手机号码";
"WeApp_GetPhoneNumber_BindedWxPhone" = "微信绑定号码";
"WeApp_GetPhoneNumber_Reject" = "拒绝";
"WeApp_GetPhoneNumber_Allow" = "允许";
"WeApp_GetPhoneNumber_AuthTitle" = "第三方手机号授权说明";
"WeApp_GetPhoneNumber_AddNewPhone" = "添加其他号码";
"WeApp_GetPhoneNumber_AddNewPhone_CompliantPrefrefix" = "如果发现不恰当收集或使用信息的行为，\n可以向平台";
"WeApp_GetPhoneNumber_AddNewPhone_Compliant" = "投诉";
"WeApp_GetPhoneNumber_ManagePhone" = "管理";
"WeApp_GetPhoneNumber_AddNewPhone_ReachLimitation" = "只可添加%d个号码";
"WeApp_GetPhoneNumber_AddNewPhone_Title" = "添加其他号码";
"WeApp_GetPhoneNumber_AddNewPhone_PhoneNumber" = "手机号码";
"WeApp_GetPhoneNumber_AddNewPhone_ConfirmCode" = "验证码";
"WeApp_GetPhoneNumber_AddNewPhone_SavePhone" = "保存此号码供以后授权使用";
"WeApp_GetPhoneNumber_AddNewPhone_SendConfirmCode" = "获取验证码";
"WeApp_GetPhoneNumber_AddNewPhone_PlaceHolder_EnterValidPhoneNumber" = "输入有效手机号";
"WeApp_GetPhoneNumber_AddNewphone_PlaceHolder_EnterConfirmCode" = "输入6位验证码";
"WeApp_GetPhoneNumber_NetError" = "网络错误";

"WeApp_RemoteDebug_MaskLabel_Disconnect" = "无网络...";
"WeApp_RemoteDebug_MaskLabel_Breakpoint" = "命中断点...";
"WeApp_RemoteDebug_MaskLabel_WaitingIDE" = "等待工具加入...";
"WeApp_RemoteDebug_MaskLabel_TooMuchMsg" = "消息积压过多...";
"WeApp_RemoteDebug_ConnectLabel_Disconnect" = "已断线";
"WeApp_RemoteDebug_ConnectLabel_Connecting" = "连接中";
"WeApp_RemoteDebug_ConnectLabel_Connected" = "已连接";
"WeApp_RemoteDebug_ConnectLabel_Reconnect" = "第%tu次尝试重试...";
"WeApp_RemoteDebug_ServerLabel_None" = "服务器--";
"WeApp_RemoteDebug_ServerLabel_Normal" = "服务器正常";
"WeApp_RemoteDebug_ServerLabel_Error" = "服务器处理出错";
"WeApp_RemoteDebug_ServerLabel_WaitIDE" = "服务器消息堆积";
"WeApp_RemoteDebug_EndReason_NotSupported" = "当前iOS版本暂不支持小游戏的远程调试";
"WeApp_RemoteDebug_EndReason_DebugFinish" = "本地调试已结束";
"WeApp_RemoteDebug_EndReason_TicketFail" = "获取票据失败";
"WeApp_RemoteDebug_EndReason_IDEQuit" = "开发工具已退出调试";
"WeApp_RemoteDebug_EndReason_IsDebug" = "房间已在调试中，不能再次加入";
"WeApp_RemoteDebug_SendFail_AskRetry" = "发送失败，是否继续重试";
"WeApp_RemoteDebug_ConnectFail_AskRetry" = "网络异常，是否继续重试";
"WeApp_RemoteDebug_PannelString_Expand" = "展开";
"WeApp_RemoteDebug_PannelString_Shrink" = "收起";
"WeApp_RemoteDebug_PannelString_Stop" = "停止";
"WeApp_RemoteDebug_PannelString_Log" = "日志";
"WeApp_RemoteDebug_PannelString_NeedConfirm" = "待确认";
"WeApp_RemoteDebug_PannelString_NeedSend" = "待发送";
"WeApp_RemoteDebug_PannelString_HasSend" = "已发送";
"WeApp_RemoteDebug_PannelString_HasRecv" = "已接收";
"WeApp_RemoteDebug_PannelString_AlwaysOnTop" = "总是最前";
"WeApp_RemoteDebug_Common_GiveUp" = "放弃";
"WeApp_RemoteDebug_Common_Retry" = "重试";
"WeApp_RemoteDebug_Connection_Error" = "连接开发者工具出错";
"WeApp_RemoteDebug_Unsupport" = "当前系统版本不支持打开小程序";

// 小程序Tips
"WeApp_Mac_Tips_EmptyBindPhone_Title" = "你还没有绑定手机号";
"WeApp_Mac_Tips_EmptyBindPhone_Msg" = "请在手机上进行相关操作";

// force close
"WeApp_ForceClose_Title" = "提示";
"WeApp_ForceClose_InjectJsError" = "加载失败";
"WeApp_ForceClose_NoActive" = "小程序意外退出，请稍候重试";
"WeApp_ForceClose_ForeApp" = "运行内存不足，请重新打开该小程序";
"weApp_ForceClose_ForeGame" = "运行内存不足，请重新打开该小游戏";
"WeApp_ForceClose_PubLibUpdate" = "资源已更新，重启小程序使用";
"WeApp_ForceClose_Lock" = "微信锁定，重启小程序使用";
"WeApp_OpenTask_Error_LaunchWeAppFail" = "小程序启动失败（错误码：%d）";
"WeApp_OpenTask_Error_PushWebViewTimeout" = "小程序推入页面超时";
"WeApp_OpenTask_Error_EnterAnimationTimeout" = "小程序加载界面超时";
"WeApp_OpenTask_Error_Multiprocess" = "进程出错了，请稍后再打开小程序";
"WeApp_OpenTask_Error_Open" = "小程序在更新，请稍后打开";

// pay
"WeApp_Pay_View_Desc" = "请使用微信扫一扫完成支付";
"WeApp_Pay_Success" = "支付成功";

// Profile
"WeApp_DebugMode_Dev" = "开发版";
"WeApp_DebugMode_RDM" = "测试版";
"WeApp_Profile_Score" = "分";
"WeApp_Profile_Location" = "正在定位";
"WeApp_Profile_Voice" = "正在录音";
"WeApp_Profile_Video" = "正在录屏";
"WeApp_Profile_Home_Disable" = "当前为首页";
"WeApp_Profile_Share_Disable" = "当前页面不可转发";
"WeApp_Profile_Setting_Disable" = "小程序设置";

// Location Service
"WeApp_Privacy_Location_Setting" = "去设置";
"WeApp_Privacy_Location_Service" = "定位服务未开启";
"WeApp_Privacy_Location_Desc" = "1.打开系统偏好设置 -> 安全性与隐私 -> 隐私 -> 定位服务 -> 启用定位服务; \n2.允许\"微信\"使用定位服务;";

"WeApp_Crash_Desc" = "小程序进程\"%@\"运行异常退出，是否重新打开?";
"WeApp_Crash_Confirm" = "重新打开";

